// Напишите программу, которая принимает на вход
// координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт
// номер четверти плоскости, в которой находится эта

Console.WriteLine("Введите координаты точки");
Console.Write ("x: ");
int x = Convert.ToInt32(Console.ReadLine());
Console.Write ("y: ");
int y = Convert.ToInt32(Console.ReadLine());


